app/Controllers/ContactController.php

    public function index()
    {
        $data['contacts'] = $this->contact->findAll();
---
SELECT *
FROM `contacts`

    public function create()
    {
        $this->contact->insert([
        'name' => $this->request->getPost('name'),
        'email' => $this->request->getPost('email'),
        'phone' => $this->request->getPost('phone'),
        'address' => $this->request->getPost('address'),]);
---
INSERT INTO `contacts` (`name`, `email`, `phone`, `address`) VALUES ('aaa', 'aa@s', 'aa', 'aa')

    public function delete($id)
    {
        $this->contact->delete($id);
---
DELETE FROM `contacts`
WHERE `id` IN ('7')