app/Controllers/Login.php

   public function auth()
   {
      $usersModel = new UsersModel();
      $username = $this->request->getPost('username');
      $password = $this->request->getPost('password');
      $user = $usersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Admin'
 LIMIT 1